app/views/orders/_form.html.erb

    <%= form.label :employee_id %>
    <%= form.select :employee_id, Employee.all.collect {|p| [ p.name, p.id ] }, id: :index_orders_on_employee_id %>
---
SELECT  "employees".* FROM "employees" ORDER BY "employees"."name" ASC LIMIT $1  [["LIMIT", 1]]