app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("total_price", "num_units", "employee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["total_price", 0.0], ["num_units", 1], ["employee_id", 4], ["created_at", "2017-06-22 19:49:33.972120"], ["updated_at", "2017-06-22 19:49:33.972120"]]

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE "orders" SET "total_price" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total_price", 103.95], ["updated_at", "2017-06-22 19:51:20.617771"], ["id", 2]]